app/Services/PengaturanService.php

SELECT *
FROM `tbl_pengaturan`
 LIMIT 1
---
    public function getNamaKampus()
    {
        $pengaturan = $this->pengaturanModel->first(); // Mengambil baris pertama dari tabel