app/Services/SettingsService.php

SELECT *
FROM `tbl_pengaturan`
WHERE `tbl_pengaturan`.`id` = 1
---
    public function getNamaKampus()
    {
        $pengaturanModel = new PengaturanModel();
        $pengaturan = $pengaturanModel->find(1); // Sesuaikan dengan id pengaturan yang sesuai