app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        // Preload any models, libraries, etc, here.

        // E.g.: $this->session = \Config\Services::session();

        // Hitung jumlah data baru dalam 12 jam terakhir
        $model = new PengeluaranmurniModel();
        $waktu12JamLalu = date('Y-m-d H:i:s', strtotime('-12 hours'));
        $queryDataBaru = $model->where('created_at >', $waktu12JamLalu)->findAll();
---
SELECT *
FROM `tbl_pengeluaran_murni`
WHERE `created_at` > '2024-06-15 21:30:04'