app/Controllers/Peminjaman.php

INSERT INTO `tbl_peminjaman` (`kode_pinjam`, `nama_peminjam`, `user_id`, `nama_ruangan`, `nama_dosen`, `tanggal_pinjam`, `keperluan`, `created_at`, `updated_at`) VALUES ('P-YKY-LAB-00172', '2923003-Ranny Nandang Saputra', '24', 'Laboratorium Keperawatan Lantai 2', 'Dwi Wulan Minarsih, S.Kep.Ns.,M.Kep ', '2024-06-10 19:58:26', 'Kegiatan Lainnya', '2024-06-10 19:58:26', '2024-06-10 19:58:26')
---
        $dataPeminjaman['keperluan'] = $keperluan;

        // Simpan data peminjaman
        $peminjamanId = $this->peminjamanModel->insert($dataPeminjaman);

INSERT INTO `tbl_peminjaman_barang` (`peminjaman_id`, `barang_id`) VALUES (105, '3217')
UPDATE `tbl_barang` SET `status_barang` = 1, `updated_at` = '2024-06-10 19:58:26'
WHERE `tbl_barang`.`id` IN ('3217')
---
                'peminjaman_id' => $peminjamanId,
                'barang_id' => $barangId,
            ];
            $this->peminjamanbarangModel->insert($dataPeminjamanBarang);

            // Update status_barang menjadi 1 pada tbl_barang
            $this->barangModel->update($barangId, ['status_barang' => 1]);

DELETE FROM `tbl_peminjaman`
WHERE `id` IN ('113')
---
    public function hapusRiwayat($peminjamanId)
    {
        // Membuat instance model
        $riwayatPeminjamanModel = new \App\Models\RiwayatPeminjamanModel();
        $pengembalianbarangModel = new \App\Models\PengembalianbarangModel();
        $peminjamanModel = new \App\Models\PeminjamanModel(); // Tambahkan model peminjaman

        try {
            // Cek apakah ada data di tbl_riwayat_pengembalian yang terkait dengan peminjaman_id
            $pengembalianTerkait = $pengembalianbarangModel->where('peminjaman_id', $peminjamanId)->findAll();

            if (!empty($pengembalianTerkait)) {
                // Jika ada data terkait, batalkan penghapusan dan kirim pesan error

                // Mengambil kode_pinjam berdasarkan peminjaman_id
                $peminjaman = $peminjamanModel->find($peminjamanId);
                $kodePinjam = $peminjaman['kode_pinjam']; // Ambil kode_pinjam dari hasil query

                return $this->response->setJSON([
                    'status' => 'error',
                    'message' => 'Masih ada data pada pengembalian. Hapus terlebih dahulu data pengembalian, dengan Kode Pinjam: ' . $kodePinjam . '.'
                ]);
            }

            // Menghapus data dari tabel riwayat peminjaman
            $deletedRiwayat = $riwayatPeminjamanModel->deleteByPeminjamanId($peminjamanId);