app/Controllers/Pengembalian.php

DELETE FROM `tbl_peminjaman_barang`
WHERE `peminjaman_id` = '13'
AND `barang_id` = '3317'
---
    public function penghapusanKodeKembali($kodeKembali)
    {
        // Memeriksa izin penghapusan berdasarkan level pengguna
        $userLevel = session()->get('level');
        $flashData = [];

        if ($userLevel == 'Admin') {
            // Gunakan metode model untuk menemukan ID peminjaman dan barang berdasarkan kode_kembali
            $ids = $this->pengembalianbarangModel->findPeminjamanBarangIdsByKodeKembali($kodeKembali);

            // Jika data ditemukan
            if ($ids !== null) {
                // Hapus data dari tabel pengembalianbarang berdasarkan kode_kembali
                $this->pengembalianbarangModel->where('kode_kembali', $kodeKembali)->delete();

                // Hapus data dari tabel tbl_peminjaman_barang berdasarkan peminjaman_id dan barang_id
                if (!empty($ids['peminjaman_ids']) && !empty($ids['barang_ids'])) {
                    foreach ($ids['peminjaman_ids'] as $index => $peminjaman_id) {
                        $barang_id = $ids['barang_ids'][$index];

                        // Menghapus data dari tabel tbl_peminjaman_barang berdasarkan peminjaman_id dan barang_id
                        $this->peminjamanbarangModel->where([
                            'peminjaman_id' => $peminjaman_id,
                            'barang_id' => $barang_id
                        ])->delete();