app/Models/BackupModel.php

    public function getLatestBackups($limit = 2)
    {
        return $this->orderBy('created_at', 'DESC')->findAll($limit);
---
SELECT *
FROM `tbl_backup`
ORDER BY `created_at` DESC
 LIMIT 4

    public function deleteExpiredBackups()
    {
        // Menghitung tanggal 60 hari yang lalu
        $expiredDate = date('Y-m-d', strtotime('-30 days'));

        // Mengambil data backup yang sudah kadaluarsa
        $expiredBackups = $this->where('created_at <', $expiredDate)->findAll();

        // Looping melalui data backup yang sudah kadaluarsa
        foreach ($expiredBackups as $backup) {
            // Mendapatkan nama file backup
            $namaFile = $backup['nama_file'];

            // Menghapus file sumber jika ada
            $filePath = 'database/backup/' . $namaFile; // Sesuaikan dengan path file Anda
            if (file_exists($filePath)) {
                unlink($filePath); // Menghapus file
            }
        }

        // Menghapus data backup yang sudah kadaluarsa dari database
        $this->where('created_at <', $expiredDate)->delete();
---
SELECT *
FROM `tbl_backup`
WHERE `created_at` < '2024-05-17'
DELETE FROM `tbl_backup`
WHERE `created_at` < '2024-05-17'