app/Models/BarangModel.php

SELECT *
FROM `tbl_barang`
WHERE `disewakan` = 'Ya'
AND `status_barang` = 0
AND `tbl_barang`.`deleted_at` IS NULL
---
    public function getBarangDisewakan()
    {
        return $this->where(['disewakan' => 'Ya', 'status_barang' => 0])->findAll();

SELECT *
FROM `tbl_barang`
WHERE `status_barang` = 0
AND `kondisi_barang` = 'baik'
AND `tbl_barang`.`deleted_at` IS NULL
---
    public function getBarangByStatus()
    {
        return $this->where('status_barang', 0)
            ->where('kondisi_barang', 'baik') // Tambahkan kondisi where untuk kondisi_barang
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `tbl_barang`
WHERE `kondisi_barang` = 'rusak'
AND `tbl_barang`.`deleted_at` IS NULL
---
    public function groupByNamaBarangRusak()
    {
        $query = $this->select('id, nama_barang, kode_barang, SUM(jumlah_barang) as total_jumlah')
            ->where('kondisi_barang', 'rusak') // Tambahkan kondisi where untuk kondisi_barang
            ->groupBy('nama_barang')
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `tbl_barang`
WHERE `kondisi_barang` = 'rusak'
AND `tbl_barang`.`deleted_at` IS NULL
---
    public function hitungJumlahBarangRusak()
    {
        return $this->where('kondisi_barang', 'rusak')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_barang`
WHERE `kondisi_barang` = 'baik'
AND `tbl_barang`.`deleted_at` IS NULL
---
    public function hitungJumlahBarangBaik()
    {
        return $this->where('kondisi_barang', 'baik')->countAllResults();