app/Models/DosenTendikModel.php

    public function getDosenTendikbyNik($nik)
    {
        return $this->where('nik', $nik)->findAll();
---
SELECT *
FROM `tbl_dosen_tendik`
WHERE `nik` = 'admin'

    public function getDosenTendik()
    {
        return $this->findAll();
---
SELECT *
FROM `tbl_dosen_tendik`

    public function getDosen()
    {
        // Menampilkan data yang memiliki jabatan=Dosen
        return $this->where('jabatan', 'Dosen')->findAll();
---
SELECT *
FROM `tbl_dosen_tendik`
WHERE `jabatan` = 'Dosen'