app/Models/NotificationModel.php

    public function getUserNotifications($userId)
    {
        // Hanya mengambil notifikasi yang belum dibaca
        return $this->where('user_id', $userId)
            ->where('read_status', 0)
            ->orderBy('created_at', 'desc')
            ->findAll();
---
SELECT *
FROM `notifications`
WHERE `user_id` = '24'
AND `read_status` = 0
ORDER BY `created_at` DESC

    public function markAsRead($notificationId)
    {
        // Memperbarui read_status menjadi 1 (telah dibaca) untuk notifikasi dengan ID tertentu
        $this->where('id', $notificationId)
            ->set(['read_status' => 1])
            ->update();
---
UPDATE `notifications` SET `read_status` = 1
WHERE `id` = '43'