app/Models/PeminjamanbarangModel.php

SELECT COUNT(DISTINCT(peminjaman_id)) AS `jumlah_peminjaman`
FROM `tbl_peminjaman_barang`
---
    public function hitungJumlahPeminjaman()
    {
        $result = $this->selectCount('DISTINCT(peminjaman_id)', 'jumlah_peminjaman', false)->get()->getRowArray();

SELECT `tbl_peminjaman`.`id` as `peminjaman_id`, `kode_pinjam`, `nama_peminjam`, `nama_ruangan`, `tanggal_pinjam`, `tanggal_pengembalian`, `nama_dosen`, `keperluan`, GROUP_CONCAT(tbl_barang.id) as barang_ids, GROUP_CONCAT(CONCAT(tbl_barang.nama_barang, " - ", tbl_barang.kode_barang)) as barang_dipinjam, `tbl_peminjaman_barang`.`barang_id`
FROM `tbl_peminjaman_barang`
JOIN `tbl_barang` ON `tbl_barang`.`id` = `tbl_peminjaman_barang`.`barang_id`
JOIN `tbl_peminjaman` ON `tbl_peminjaman`.`id` = `tbl_peminjaman_barang`.`peminjaman_id`
WHERE `tbl_peminjaman_barang`.`peminjaman_id` = '105'
GROUP BY `peminjaman_id`
---
    public function getPeminjamanBarangByPeminjamanId($peminjamanId)
    {
        return $this->select('
                    tbl_peminjaman.id as peminjaman_id,
                    kode_pinjam,
                    nama_peminjam,
                    nama_ruangan,
                    tanggal_pinjam,
                    tanggal_pengembalian,
                    nama_dosen,
                    keperluan,
                    GROUP_CONCAT(tbl_barang.id) as barang_ids,
                    GROUP_CONCAT(CONCAT(tbl_barang.nama_barang, " - ", tbl_barang.kode_barang)) as barang_dipinjam,
                    tbl_peminjaman_barang.barang_id') // Menambahkan kolom barang_id
            ->join('tbl_barang', 'tbl_barang.id = tbl_peminjaman_barang.barang_id')
            ->join('tbl_peminjaman', 'tbl_peminjaman.id = tbl_peminjaman_barang.peminjaman_id')
            ->where('tbl_peminjaman_barang.peminjaman_id', $peminjamanId)
            ->groupBy('peminjaman_id')
            ->findAll();

SELECT `tbl_peminjaman_barang`.*, `tbl_peminjaman`.`kode_pinjam`, `tbl_peminjaman`.`nama_peminjam`, `tbl_peminjaman`.`nama_ruangan`, `tbl_barang`.`kode_barang`, `tbl_barang`.`nama_barang`
FROM `tbl_peminjaman_barang`
JOIN `tbl_peminjaman` ON `tbl_peminjaman`.`id` = `tbl_peminjaman_barang`.`peminjaman_id`
JOIN `tbl_barang` ON `tbl_barang`.`id` = `tbl_peminjaman_barang`.`barang_id`
WHERE `tbl_peminjaman`.`kode_pinjam` = 'P-YKY-LAB-00141'
---
    public function getPeminjamanBarangData($kodePinjam)
    {
        return $this->select('
                tbl_peminjaman_barang.*,
                tbl_peminjaman.kode_pinjam,
                tbl_peminjaman.nama_peminjam,
                tbl_peminjaman.nama_ruangan,
                tbl_barang.kode_barang,
                tbl_barang.nama_barang
            ')
            ->join('tbl_peminjaman', 'tbl_peminjaman.id = tbl_peminjaman_barang.peminjaman_id')
            ->join('tbl_barang', 'tbl_barang.id = tbl_peminjaman_barang.barang_id')
            ->where('tbl_peminjaman.kode_pinjam', $kodePinjam)
            ->findAll();

SELECT `barang_id`
FROM `tbl_peminjaman_barang`
WHERE `peminjaman_id` = '113'
UPDATE `tbl_barang` SET `status_barang` = 0
WHERE `id` = '3213'
DELETE FROM `tbl_peminjaman_barang`
WHERE `peminjaman_id` = '113'
---
    public function deleteByPeminjamanId($peminjamanId)
    {
        // Mengambil semua barang_id yang terkait dengan peminjaman_id
        $barangIds = $this->select('barang_id')->where('peminjaman_id', $peminjamanId)->findAll();

        // Ubah status_barang menjadi 0 pada tabel tbl_barang untuk setiap barang_id
        foreach ($barangIds as $barangId) {
            $this->db->table('tbl_barang')
                ->set('status_barang', 0)
                ->where('id', $barangId['barang_id'])
                ->update();
        }

        // Hapus data pada tabel tbl_peminjaman_barang berdasarkan peminjaman_id
        return $this->where('peminjaman_id', $peminjamanId)->delete();