app/Models/PeminjamanModel.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_peminjaman`
WHERE `keperluan` LIKE '%Praktek Pembelajaran%' ESCAPE '!'
AND YEAR(tanggal_pinjam) = '2024'
---
    public function getByKeperluanKeyword($keyword, $year = null)
    {
        // Membuat objek builder
        $builder = $this->db->table($this->table);

        // Mencari jumlah data yang memenuhi kriteria secara parsial
        $builder->like('keperluan', $keyword);

        // Menambahkan filter tahun jika tahun diberikan
        if (!empty($year)) {
            $builder->where('YEAR(tanggal_pinjam)', $year);
        }

        $count = $builder->countAllResults();

SELECT `nilai_kode_pinjam`
FROM `tbl_pengaturan`
---
    public function generateKodePinjam()
    {
        // Ambil nilai nilai_kode_pinjam dari database
        $nilai_kode_pinjam = $this->db->table('tbl_pengaturan')->select('nilai_kode_pinjam')->get()->getRow()->nilai_kode_pinjam;