app/Models/PenerimaanPersediaanModel.php

SELECT `tbl_persediaan_penerimaan_detail`.*, `tbl_persediaan_barang`.`nama_barang`, `tbl_persediaan_barang`.`stok`
FROM `tbl_persediaan_penerimaan_detail`
JOIN `tbl_persediaan_barang` ON `tbl_persediaan_barang`.`id` = `tbl_persediaan_penerimaan_detail`.`barang_id`
---
    public function tampilkanData()
    {
        $builder = $this->db->table('tbl_persediaan_penerimaan_detail');
        $builder->select('tbl_persediaan_penerimaan_detail.*, tbl_persediaan_barang.nama_barang, tbl_persediaan_barang.stok');
        $builder->join('tbl_persediaan_barang', 'tbl_persediaan_barang.id = tbl_persediaan_penerimaan_detail.barang_id');


        $query = $builder->get();

SELECT `tbl_persediaan_penerimaan_detail`.`barang_id`, `tbl_persediaan_barang`.`nama_barang`, `tbl_persediaan_barang`.`harga_satuan`, SUM(tbl_persediaan_penerimaan_detail.jumlah_barang) as jumlah_barang
FROM `tbl_persediaan_penerimaan_detail`
JOIN `tbl_persediaan_penerimaan` ON `tbl_persediaan_penerimaan`.`id` = `tbl_persediaan_penerimaan_detail`.`penerimaan_id`
JOIN `tbl_persediaan_barang` ON `tbl_persediaan_barang`.`id` = `tbl_persediaan_penerimaan_detail`.`barang_id`
WHERE YEAR(tbl_persediaan_penerimaan.tanggal_penerimaan) <= '2024'
GROUP BY `tbl_persediaan_penerimaan_detail`.`barang_id`
---
    public function getAllBarangDataUntilYear($year)
    {
        return $this->select('tbl_persediaan_penerimaan_detail.barang_id, tbl_persediaan_barang.nama_barang, tbl_persediaan_barang.harga_satuan, tbl_persediaan_barang.satuan, SUM(tbl_persediaan_penerimaan_detail.jumlah_barang) as jumlah_barang')
            ->join('tbl_persediaan_penerimaan', 'tbl_persediaan_penerimaan.id = tbl_persediaan_penerimaan_detail.penerimaan_id')
            ->join('tbl_persediaan_barang', 'tbl_persediaan_barang.id = tbl_persediaan_penerimaan_detail.barang_id')
            ->where('YEAR(tbl_persediaan_penerimaan.tanggal_penerimaan) <=', $year)
            ->groupBy('tbl_persediaan_penerimaan_detail.barang_id')
            ->findAll();