app/Models/PengeluaranModel.php

SELECT `tbl_pengeluaran_persediaan`.*, `tbl_persediaan_barang`.`nama_barang`
FROM `tbl_pengeluaran_persediaan`
JOIN `tbl_persediaan_barang` ON `tbl_persediaan_barang`.`id` = `tbl_pengeluaran_persediaan`.`barang_id`
WHERE `tbl_pengeluaran_persediaan`.`peminjaman_id` = '105'
---
    public function getPengeluaranByPeminjamanId($peminjamanId)
    {
        $builder = $this->db->table('tbl_pengeluaran_persediaan');
        $builder->select('tbl_pengeluaran_persediaan.*, tbl_persediaan_barang.nama_barang');
        $builder->join('tbl_persediaan_barang', 'tbl_persediaan_barang.id = tbl_pengeluaran_persediaan.barang_id');
        $builder->where('tbl_pengeluaran_persediaan.peminjaman_id', $peminjamanId);

        return $builder->get()->getResult();

SELECT `tbl_pengeluaran_persediaan`.`barang_id`, `tbl_persediaan_barang`.`nama_barang`, `tbl_persediaan_barang`.`harga_satuan`, SUM(tbl_pengeluaran_persediaan.ambil_barang) as ambil_barang
FROM `tbl_pengeluaran_persediaan`
JOIN `tbl_peminjaman` ON `tbl_peminjaman`.`id` = `tbl_pengeluaran_persediaan`.`peminjaman_id`
JOIN `tbl_persediaan_barang` ON `tbl_persediaan_barang`.`id` = `tbl_pengeluaran_persediaan`.`barang_id`
WHERE MONTH(tbl_peminjaman.tanggal_pinjam) = '01'
AND YEAR(tbl_peminjaman.tanggal_pinjam) = '2024'
GROUP BY `tbl_pengeluaran_persediaan`.`barang_id`
---
    public function getBarangDataByMonthAndYear($month, $year)
    {
        return $this->select('tbl_pengeluaran_persediaan.barang_id, tbl_persediaan_barang.nama_barang, tbl_persediaan_barang.harga_satuan, tbl_persediaan_barang.satuan, SUM(tbl_pengeluaran_persediaan.ambil_barang) as ambil_barang')
            ->join('tbl_peminjaman', 'tbl_peminjaman.id = tbl_pengeluaran_persediaan.peminjaman_id')
            ->join('tbl_persediaan_barang', 'tbl_persediaan_barang.id = tbl_pengeluaran_persediaan.barang_id')
            ->where('MONTH(tbl_peminjaman.tanggal_pinjam)', $month)
            ->where('YEAR(tbl_peminjaman.tanggal_pinjam)', $year)
            ->groupBy('tbl_pengeluaran_persediaan.barang_id')
            ->findAll();