app/Models/PengeluaranmurniModel.php

    public function getPengeluaranMurni()
    {
        // Dapatkan user_id dan level dari sesi
        $session = session();
        $user_id = $session->get('id');
        $user_level = $session->get('level');

        // Jika pengguna adalah admin, tampilkan semua data diurutkan berdasarkan tanggal_penggunaan
        if ($user_level == 'Admin') {
            return $this->orderBy('tanggal_penggunaan', 'DESC')->findAll();
---
SELECT *
FROM `tbl_pengeluaran_murni`
ORDER BY `tanggal_penggunaan` DESC

    public function getdetail($id)
    {
        return $this->find($id);
---
SELECT *
FROM `tbl_pengeluaran_murni`
WHERE `tbl_pengeluaran_murni`.`id` = '37'