app/Models/PengaturanModel.php

SELECT *
FROM `tbl_pengaturan`
WHERE `tbl_pengaturan`.`id` = 1
---
    public function getDataById($id)
    {
        return $this->find($id); // Mengambil data berdasarkan ID