app/Models/PengeluaranmurniDetailModel.php

SELECT `tbl_pengeluaran_murni_detail`.*, `tbl_persediaan_barang`.`nama_barang`, `tbl_pengeluaran_murni_detail`.`id` as `detail_id`
FROM `tbl_pengeluaran_murni_detail`
JOIN `tbl_persediaan_barang` ON `tbl_persediaan_barang`.`id` = `tbl_pengeluaran_murni_detail`.`barang_id`
WHERE `tbl_pengeluaran_murni_detail`.`pengguna_id` = '37'
---
    public function getDetailWithNamaBarang($penggunaId)
    {
        $builder = $this->db->table('tbl_pengeluaran_murni_detail');
        $builder->select('tbl_pengeluaran_murni_detail.*, tbl_persediaan_barang.nama_barang, tbl_pengeluaran_murni_detail.id as detail_id');
        $builder->join('tbl_persediaan_barang', 'tbl_persediaan_barang.id = tbl_pengeluaran_murni_detail.barang_id');
        $builder->where('tbl_pengeluaran_murni_detail.pengguna_id', $penggunaId);

        return $builder->get()->getResult();

SELECT `tbl_pengeluaran_murni_detail`.`barang_id`, `tbl_persediaan_barang`.`nama_barang`, `tbl_persediaan_barang`.`harga_satuan`, SUM(tbl_pengeluaran_murni_detail.ambil_barang_murni) as ambil_barang_murni
FROM `tbl_pengeluaran_murni_detail`
JOIN `tbl_pengeluaran_murni` ON `tbl_pengeluaran_murni`.`id` = `tbl_pengeluaran_murni_detail`.`pengguna_id`
JOIN `tbl_persediaan_barang` ON `tbl_persediaan_barang`.`id` = `tbl_pengeluaran_murni_detail`.`barang_id`
WHERE MONTH(tbl_pengeluaran_murni.tanggal_penggunaan) = '01'
AND YEAR(tbl_pengeluaran_murni.tanggal_penggunaan) = '2024'
GROUP BY `tbl_pengeluaran_murni_detail`.`barang_id`
---
    public function getBarangDataByMonthAndYear($month, $year)
    {
        return $this->select('tbl_pengeluaran_murni_detail.barang_id, tbl_persediaan_barang.nama_barang, tbl_persediaan_barang.harga_satuan, SUM(tbl_pengeluaran_murni_detail.ambil_barang_murni) as ambil_barang_murni')
            ->join('tbl_pengeluaran_murni', 'tbl_pengeluaran_murni.id = tbl_pengeluaran_murni_detail.pengguna_id')
            ->join('tbl_persediaan_barang', 'tbl_persediaan_barang.id = tbl_pengeluaran_murni_detail.barang_id')
            ->where('MONTH(tbl_pengeluaran_murni.tanggal_penggunaan)', $month)
            ->where('YEAR(tbl_pengeluaran_murni.tanggal_penggunaan)', $year)
            ->groupBy('tbl_pengeluaran_murni_detail.barang_id')
            ->findAll();