app/Models/PengembalianbarangModel.php

SELECT `tbl_riwayat_pengembalian`.*, `tbl_peminjaman`.*, `tbl_barang`.*
FROM `tbl_riwayat_pengembalian`
JOIN `tbl_peminjaman` ON `tbl_peminjaman`.`id` = `tbl_riwayat_pengembalian`.`peminjaman_id`
JOIN `tbl_barang` ON `tbl_barang`.`id` = `tbl_riwayat_pengembalian`.`barang_id`
---
    public function getAllDataWithRelations()
    {
        // Menggunakan query builder untuk melakukan join tabel
        $builder = $this->db->table($this->table);
        $builder->select('tbl_riwayat_pengembalian.*, tbl_peminjaman.*, tbl_barang.*');
        $builder->join('tbl_peminjaman', 'tbl_peminjaman.id = tbl_riwayat_pengembalian.peminjaman_id');
        $builder->join('tbl_barang', 'tbl_barang.id = tbl_riwayat_pengembalian.barang_id');
        $query = $builder->get();

SELECT `tbl_riwayat_pengembalian`.*, `tbl_peminjaman`.*, `tbl_barang`.*
FROM `tbl_riwayat_pengembalian`
JOIN `tbl_peminjaman` ON `tbl_peminjaman`.`id` = `tbl_riwayat_pengembalian`.`peminjaman_id`
JOIN `tbl_barang` ON `tbl_barang`.`id` = `tbl_riwayat_pengembalian`.`barang_id`
WHERE `tbl_peminjaman`.`kode_pinjam` = 'P-YKY-LAB-00141'
---
    public function getAllDataWithRelationsByKodePinjam($kodePinjam)
    {
        // Menggunakan query builder untuk melakukan join tabel
        $builder = $this->db->table($this->table);
        $builder->select('tbl_riwayat_pengembalian.*, tbl_peminjaman.*, tbl_barang.*');
        $builder->join('tbl_peminjaman', 'tbl_peminjaman.id = tbl_riwayat_pengembalian.peminjaman_id');
        $builder->join('tbl_barang', 'tbl_barang.id = tbl_riwayat_pengembalian.barang_id');
        $builder->where('tbl_peminjaman.kode_pinjam', $kodePinjam);
        $query = $builder->get();

SELECT *
FROM `tbl_user`
WHERE `id` = '1'
---
    private function isAdmin($userId)
    {
        // Query ke database atau model untuk mendapatkan level pengguna berdasarkan user_id
        $user = $this->db->table('tbl_user')->where('id', $userId)->get()->getRow();