app/Models/PihakluarDetailModel.php

    public function getCompleteData()
    {
        return $this->db->table($this->table)
            ->join('pihakluar_peminjaman', 'pihakluar_peminjaman.id = pihakluar_peminjaman_detail.peminjaman_id')
            ->join('tbl_barang', 'tbl_barang.id = pihakluar_peminjaman_detail.barang_id')
            ->select('pihakluar_peminjaman_detail.peminjaman_id, GROUP_CONCAT(pihakluar_peminjaman_detail.barang_id) as barang_ids, GROUP_CONCAT(tbl_barang.nama_barang) as nama_barangs, pihakluar_peminjaman.*, tbl_barang.*, pihakluar_peminjaman.created_at as pihakluar_created_at')
            ->groupBy('pihakluar_peminjaman_detail.peminjaman_id')
            ->get()
            ->getResultArray();
---
SELECT `pihakluar_peminjaman_detail`.`peminjaman_id`, GROUP_CONCAT(pihakluar_peminjaman_detail.barang_id) as barang_ids, GROUP_CONCAT(tbl_barang.nama_barang) as nama_barangs, `pihakluar_peminjaman`.*, `tbl_barang`.*, `pihakluar_peminjaman`.`created_at` as `pihakluar_created_at`
FROM `pihakluar_peminjaman_detail`
JOIN `pihakluar_peminjaman` ON `pihakluar_peminjaman`.`id` = `pihakluar_peminjaman_detail`.`peminjaman_id`
JOIN `tbl_barang` ON `tbl_barang`.`id` = `pihakluar_peminjaman_detail`.`barang_id`
GROUP BY `pihakluar_peminjaman_detail`.`peminjaman_id`