app/Models/ReservasibarangModel.php

    public function hitungJumlahBooking()
    {
        $result = $this->selectCount('DISTINCT(reservasi_id)', 'jumlah_booking', false)->get()->getRowArray();
---
SELECT COUNT(DISTINCT(reservasi_id)) AS `jumlah_booking`
FROM `tbl_reservasi_barang`