app/Models/RiwayatPeminjamanModel.php

    public function getRiwayatPeminjaman($year)
    {
        return $this->select('
                ROW_NUMBER() OVER() AS no,
                tbl_peminjaman.id as peminjaman_id,
                kode_pinjam,
                nama_peminjam,
                nama_ruangan,
                tanggal_pinjam,
                keperluan,
                GROUP_CONCAT(CONCAT(tbl_barang.nama_barang, " - ", tbl_barang.kode_barang)) as barang_dipinjam')
            ->join('tbl_barang', 'tbl_barang.id = tbl_riwayat_peminjaman.barang_id')
            ->join('tbl_peminjaman', 'tbl_peminjaman.id = tbl_riwayat_peminjaman.peminjaman_id')
            ->where('YEAR(tbl_peminjaman.tanggal_pinjam)', $year)
            ->groupBy('tbl_riwayat_peminjaman.peminjaman_id')
            ->orderBy('tanggal_pinjam', 'DESC') // Menambahkan orderBy untuk mengurutkan berdasarkan tanggal_pinjam secara descending
            ->findAll();
---
SELECT ROW_NUMBER() OVER() AS no, `tbl_peminjaman`.`id` as `peminjaman_id`, `kode_pinjam`, `nama_peminjam`, `nama_ruangan`, `tanggal_pinjam`, `keperluan`, GROUP_CONCAT(CONCAT(tbl_barang.nama_barang, " - ", tbl_barang.kode_barang)) as barang_dipinjam
FROM `tbl_riwayat_peminjaman`
JOIN `tbl_barang` ON `tbl_barang`.`id` = `tbl_riwayat_peminjaman`.`barang_id`
JOIN `tbl_peminjaman` ON `tbl_peminjaman`.`id` = `tbl_riwayat_peminjaman`.`peminjaman_id`
WHERE YEAR(tbl_peminjaman.tanggal_pinjam) = '2024'
GROUP BY `tbl_riwayat_peminjaman`.`peminjaman_id`
ORDER BY `tanggal_pinjam` DESC

    public function getUniqueYears()
    {
        return $this->distinct()->select('YEAR(tanggal_pinjam) as tahun')->from('tbl_peminjaman')->orderBy('tahun', 'ASC')->findAll();
---
SELECT DISTINCT YEAR(tanggal_pinjam) as tahun
FROM `tbl_riwayat_peminjaman`, `tbl_peminjaman`
ORDER BY `tahun` ASC

    public function getAvailableYears()
    {
        // Mengambil tahun-tahun unik dari kolom tanggal_pinjam
        $query = $this->select('YEAR(tanggal_pinjam) AS tahun')->from('tbl_peminjaman')->distinct()->orderBy('tahun', 'DESC')->findAll();
---
SELECT DISTINCT YEAR(tanggal_pinjam) AS tahun
FROM `tbl_riwayat_peminjaman`, `tbl_peminjaman`
ORDER BY `tahun` DESC

    public function getRiwayatPeminjamanData($kodePinjam)
    {
        return $this->select('
                tbl_riwayat_peminjaman.*,
                tbl_peminjaman.kode_pinjam,
                tbl_peminjaman.nama_peminjam,
                tbl_peminjaman.nama_ruangan,
                tbl_barang.kode_barang,
                tbl_barang.nama_barang
            ')
            ->join('tbl_peminjaman', 'tbl_peminjaman.id = tbl_riwayat_peminjaman.peminjaman_id')
            ->join('tbl_barang', 'tbl_barang.id = tbl_riwayat_peminjaman.barang_id')
            ->where('tbl_peminjaman.kode_pinjam', $kodePinjam)
            ->findAll();
---
SELECT `tbl_riwayat_peminjaman`.*, `tbl_peminjaman`.`kode_pinjam`, `tbl_peminjaman`.`nama_peminjam`, `tbl_peminjaman`.`nama_ruangan`, `tbl_barang`.`kode_barang`, `tbl_barang`.`nama_barang`
FROM `tbl_riwayat_peminjaman`
JOIN `tbl_peminjaman` ON `tbl_peminjaman`.`id` = `tbl_riwayat_peminjaman`.`peminjaman_id`
JOIN `tbl_barang` ON `tbl_barang`.`id` = `tbl_riwayat_peminjaman`.`barang_id`
WHERE `tbl_peminjaman`.`kode_pinjam` = 'P-YKY-LAB-00141'