app/Models/RuanganModel.php

SELECT *
FROM `tbl_ruangan`
---
    public function getRuangan()
    {
        return $this->findAll();