app/Models/SatuanModel.php

    public function getSatuan()
    {
        return $this->findAll();
---
SELECT *
FROM `tbl_satuan`