app/Models/StokBulananModel.php

SELECT `bulan`, SUM(sisa_stok) as total_stok
FROM `tbl_stok_bulanan`
WHERE `tahun` = '2024'
GROUP BY `bulan`
ORDER BY `bulan` ASC
---
    public function filterByYearAndGroupByMonth($year)
    {
        return $this->select('bulan, SUM(sisa_stok) as total_stok')
            ->where('tahun', $year)
            ->groupBy('bulan')
            ->orderBy('bulan', 'ASC')
            ->findAll();

SELECT `tbl_stok_bulanan`.*, `tbl_persediaan_barang`.`nama_barang`
FROM `tbl_stok_bulanan`
JOIN `tbl_persediaan_barang` ON `tbl_persediaan_barang`.`id` = `tbl_stok_bulanan`.`barang_id`
WHERE `bulan` = '01'
AND `tahun` = '2024'
---
    public function getDataBulanTahunSebelumnya($bulan, $tahun)
    {
        // Menghitung bulan dan tahun sebelumnya
        $bulanSebelumnya = $bulan - 1;
        $tahunSebelumnya = $tahun;

        if ($bulanSebelumnya == 0) {
            // Jika bulan sebelumnya adalah Desember, tahun sebelumnya adalah tahun sekarang - 1
            $bulanSebelumnya = 12;
            $tahunSebelumnya = $tahun - 1;
        }

        // Membuat kueri untuk mendapatkan data dengan join ke tabel barang
        $query = $this->db->table('tbl_stok_bulanan')
            ->select('tbl_stok_bulanan.*, tbl_persediaan_barang.nama_barang, tbl_persediaan_barang.satuan')
            ->join('tbl_persediaan_barang', 'tbl_stok_bulanan.barang_id = tbl_persediaan_barang.id', 'left')
            ->where('tbl_stok_bulanan.bulan', $bulanSebelumnya)
            ->where('tbl_stok_bulanan.tahun', $tahunSebelumnya)
            ->get();