app/Models/UserModel.php

    public function getUserIDByNimNik($nim_nik)
    {
        // Cari user berdasarkan nim/nik di kolom user_nama
        $user = $this->where('user_nama', $nim_nik)->first();
---
SELECT *
FROM `tbl_user`
WHERE `user_nama` = '2923003'
 LIMIT 1

    public function get_data($username, $password)
    {
        $user = $this->where('user_nama', $username)->first();
---
SELECT *
FROM `tbl_user`
WHERE `user_nama` = '2923003'
 LIMIT 1

    public function getUser()
    {
        return $this->whereNotIn('id', [1, 2])->findAll();
---
SELECT *
FROM `tbl_user`
WHERE `id` NOT IN (1,2)

    public function updateUser($akunId, $data)
    {
        return $this->db->table('tbl_user')
            ->where('id', $akunId) // Ubah 'user_id' menjadi 'id'
            ->update($data);
---
UPDATE `tbl_user` SET `ip_address` = '::1'
WHERE `id` = '41'